#+TITLE: Org-Mode Marking & Integrations for the Canvas LMS

*** Building a usable course object in lisp
Thesewre my first experiments making a lisp data structure. It's a bit ugly.
#+begin_src emacs-lisp
  (let*
      ((students (org-lms~parse-plist-csv-file "./students.csv"))
      (darwin
        '((name . "Response Paper 1" )
          (directory . "response-paper-1")
          (weight . 0.10)
          (type . "letter")
          (rubric-list . ("Organization" "Clarity of Argument"
                           "Grammar and Spelling" "Grade"
                           "See Attached Paper for further Comments"))))
          (atitle (alist-get 'name darwin))
          (rubric-list (alist-get 'rubric-list darwin))
          (value "")
       )
    ;;(prin1 rubric-list)
    (setq fakevar (dolist (item  rubric-list value)
      ;;(prin1 item)
     ;;(setq value "hello")
(message "value is %s" value)
      (setq value (concat value (format "- %s \n" item)))))
(message "%s" fakevar)
value
       ;; (dolist (item rubric-list)
       ;; (message "%s" item))
     
     (org-lms-make-headings darwin students)
  )


#+end_src

#+RESULTS:
: - Organization 
: - Clarity of Argument 
: - Grammar and Spelling 
: - Grade 
: - See Attached Paper for further Comments 


